block = [  # (y, x)
    [[0, 0], [1, 0], [2, 0], [3, 0]],
    [[0, 0], [0, 1], [0, 2], [0, 3]],
    [[0, 0], [1, 0], [0, 1], [1, 1]],
    [[0, 0], [1, 0], [2, 0], [2, 1]],
    [[0, 0], [1, 0], [0, 1], [0, 2]],
    [[0, 0], [0, 1], [1, 1], [2, 1]],
    [[0, 2], [1, 0], [1, 1], [1, 2]],
    [[0, 0], [1, 0], [1, 1], [2, 1]],
    [[1, 0], [1, 1], [0, 1], [0, 2]],
    [[0, 0], [0, 1], [0, 2], [1, 1]],
    [[0, 1], [1, 0], [1, 1], [2, 1]],
    [[1, 0], [0, 1], [1, 1], [1, 2]],
    [[0, 0], [1, 0], [1, 1], [2, 0]],
    [[0, 1], [1, 1], [2, 0], [2, 1]],
    [[0, 0], [1, 0], [1, 1], [1, 2]],
    [[0, 0], [0, 1], [1, 0], [2, 0]],
    [[0, 0], [0, 1], [0, 2], [1, 2]],
    [[0, 0], [0, 1], [1, 1], [1, 2]],
    [[0, 1], [1, 1], [1, 0], [2, 0]]
]

n, m = map(int, input().split())
t = []
for i in range(n):
    t.append(list(map(int, input().split())))

result = 0
for row in range(n):  # 모든 좌표에 대하여 확인 진행
    for column in range(m):
        for b in block:  # 모든 블럭을 하나씩 확인
            now_result = 0
            for y, x in b:  # 블럭이 속한 4개칸의 값을 합산
                if (row + y < n) and (column + x < m):
                    now_result += t[row + y][column + x]
                else:
                    break
            result = max(result, now_result)  # 최대값 갱신진행
print(result)
